Revit 2027 API
StructuralConnectionHandlerType.Create(Document, String, Guid, String, ElementId) Method
 Creates a new StructuralConnectionHandlerType object.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static StructuralConnectionHandlerType Create(
	Document pADoc,
	string name,
	Guid guid,
	string familyName,
	ElementId categoryId
)
Public Shared Function Create (
	pADoc As Document,
	name As String,
	guid As Guid,
	familyName As String,
	categoryId As ElementId
) As StructuralConnectionHandlerType
public:
static StructuralConnectionHandlerType^ Create(
	Document^ pADoc,
	String^ name,
	Guid guid,
	String^ familyName,
	ElementId^ categoryId
)
static member Create :
        pADoc : Document *
        name : string *
        guid : Guid *
        familyName : string *
        categoryId : ElementId -> StructuralConnectionHandlerType
Parameters
pADoc Document
 The document.
name String
 The type name.
guid Guid
 Connection GUID.
familyName String
 Name of system family which created type will belong to.
categoryId ElementId
 Category identity of connection type.
Return Value
StructuralConnectionHandlerType
 The newly created instance.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
StructuralConnectionHandlerType Class
Create Overload
Autodesk.Revit.DB.Structure Namespace